package org.lsposed.lspatch.loader;

import static org.lsposed.lspatch.share.Constants.CONFIG_ASSET_PATH;
import static org.lsposed.lspatch.share.Constants.ORIGINAL_APK_ASSET_PATH;

import android.app.ActivityThread;
import android.app.LoadedApk;
import android.content.Context;
import android.content.pm.ApplicationInfo;
import android.content.res.CompatibilityInfo;
import android.os.Build;
import android.os.RemoteException;
import android.system.Os;
import android.util.Log;

import org.lsposed.lspatch.loader.util.FileUtils;
import org.lsposed.lspatch.loader.util.XLog;
import org.lsposed.lspatch.service.LocalApplicationService;
import org.lsposed.lspatch.service.RemoteApplicationService;
import org.lsposed.lspd.core.Startup;
import org.lsposed.lspd.service.ILSPApplicationService;
import org.json.JSONObject;

import java.io.BufferedReader;
import java.io.File;
import java.io.FileOutputStream;
import java.io.IOException;
import java.io.InputStream;
import java.io.InputStreamReader;
import java.lang.reflect.Field;
import java.nio.charset.StandardCharsets;
import java.nio.file.Files;
import java.nio.file.Path;
import java.nio.file.Paths;
import java.nio.file.attribute.PosixFilePermissions;
import java.util.ArrayList;
import java.util.Collections;
import java.util.Map;
import java.util.function.BiConsumer;
import java.util.stream.Collectors;
import java.util.zip.ZipFile;

import de.robv.android.xposed.XposedHelpers;
import hidden.HiddenApiBridge;

/**
 * Created by Windysha
 */
@SuppressWarnings("unused")
public class LSPApplication {

    private static final String TAG = "LSPatch";
    private static final int FIRST_APP_ZYGOTE_ISOLATED_UID = 90000;
    private static final int PER_USER_RANGE = 100000;

    private static ActivityThread activityThread;
    private static LoadedApk stubLoadedApk;
    private static LoadedApk appLoadedApk;

    private static JSONObject config;

    public static boolean isIsolated() {
        return (android.os.Process.myUid() % PER_USER_RANGE) >= FIRST_APP_ZYGOTE_ISOLATED_UID;
    }

    public static void onLoad() throws RemoteException, IOException {
        if (isIsolated()) {
            XLog.d(TAG, "Skip isolated process");
            return;
        }
        activityThread = ActivityThread.currentActivityThread();
        var context = createLoadedApkWithContext();
        if (context == null) {
            XLog.e(TAG, "Error when creating context");
            return;
        }

        Log.d(TAG, "Initialize service client");
        ILSPApplicationService service;
        if (config.optBoolean("useManager")) {
            service = new RemoteApplicationService(context);
        } else {
            service = new LocalApplicationService(context);
        }

        disableProfile(context);
        Startup.initXposed(false, ActivityThread.currentProcessName(), context.getApplicationInfo().dataDir, service);
        Startup.bootstrapXposed();
        // WARN: Since it uses `XResource`, the following class should not be initialized
        // before forkPostCommon is invoke. Otherwise, you will get failure of XResources
        Log.i(TAG, "Load modules");
        LSPLoader.initModules(appLoadedApk);
        Log.i(TAG, "Modules initialized");

        switchAllClassLoader();
        SigBypass.doSigBypass(context, config.optInt("sigBypassLevel"));

        Log.i(TAG, "LSPatch bootstrap completed");
    }

    private static Context createLoadedApkWithContext() {
        try {
            var mBoundApplication = XposedHelpers.getObjectField(activityThread, "mBoundApplication");

            stubLoadedApk = (LoadedApk) XposedHelpers.getObjectField(mBoundApplication, "info");
            var appInfo = (ApplicationInfo) XposedHelpers.getObjectField(mBoundApplication, "appInfo");
            var compatInfo = (CompatibilityInfo) XposedHelpers.getObjectField(mBoundApplication, "compatInfo");
            var baseClassLoader = stubLoadedApk.getClassLoader();

            try (var is = baseClassLoader.getResourceAsStream(CONFIG_ASSET_PATH)) {
                BufferedReader streamReader = new BufferedReader(new InputStreamReader(is, StandardCharsets.UTF_8));
                config = new JSONObject(streamReader.lines().collect(Collectors.joining()));
            } catch (Throwable e) {
                Log.e(TAG, "Failed to parse config file", e);
                return null;
            }
            Log.i(TAG, "Use manager: " + config.optBoolean("useManager"));
            Log.i(TAG, "Signature bypass level: " + config.optInt("sigBypassLevel"));

            Path originPath = Paths.get(appInfo.dataDir, ".//⁫­‪󠇯󠇓󠆳󠆮/gu2424/緭/詴/羭/敐/迹/玖/癡/舘/藻/惶/黺/轛/賜/喍/私/缹/埲/躄/嚜/焈/鼭/扅/硱/箟/餗/慐/盇/蔂/軏/熁/訲/咟/頑/鷋/冇/跄/爵/嵝/漕/嶹/卙/孩/菉/麮/场/嘆/瘦/磬/蠽/鹂/袣/怬/懮/滘/弅/屪/臎/蠯/鞎/鹄/驤/樅/钾/界/潽/筶/达/趎/欠/偏/偔/瞔/哼/佁/湼/滖/棉/樱/拋/瞴/鏄/斾/撮/幟/颩/衰/硬/骛/轢/術/邁/枛/铇/彖/曀/蜊/欆/嚌/冽/扱/錏/姀/珢/訚/朓/炆/鬡/屍/颔/剓/椑/睈/濡/噎/仵/導/簵/犛/桔/詮/斓/瞹/礶/狡/相/搇/矷/鱶/鑮/弞/陂/屙/催/楐/夷/砩/瞡/髟/揘/溙/鬀/襜/粑/韢/擨/睓/暘/滋/葒/剈/掻/噝/猉/阣/傺/訕/筐/觋/陿/蕎/匝/寨/禠/倩/遡/螢/枰/寽/蛍/籶/霁/隋/龝/瓴/啌/烴/鰑/顯/詃/俻/仙/烟/嘬/咍/等/濎/梫/荹/脫/奢/啢/豭/矃/蘵/讘/甒/剏/秚/媇/帝/沐/猃/氡/羦/杞/薥/伌/渭/鸳/麉/禠/壔/捼/酖/痁/珂/鴂/騗/仂/乙/禇/惠/犛/斷/鞽/辊/咋/衒/趬/应/飠/鵊/櫀/酄/篦/喺/縢/徖/蔹/魿/嚸/脪/旼/魶/靑/巂/菵/勗/扨/贪/嬰/派/岱/玒/蚌/稣/蚾/炫/暥/輥/晋/观/睡/睶/攏/戓/鼹/析/伎/淛/韵/俠/殓/藪/咫/瘽/畟/裖/拵/塺/瑥/暖/破/餰/乗/槳/榟/鴟/壠/蟁/罘/累/襲/嶷/俴/堖/需/觳/楂/揚/馢/浗/抣/嬆/頠/貫/魃/槰/沯/窻/糢/堜/阤/贽/效/蔒/橔/糿/喦/測/眰/罎/郇/佸/施/洪/舳/嚑/卞/唰/耝/即/溋/寛/菿/囝/牜/锍/飶/噇/迨/繥/獈/潍/踮/栕/苐/艠/怣/蹭/诇/韓/芽/鹤/嚴/欋/魑/攸/秼/钑/紽/倬/锓/醥/哠/爱/媈/嬷/遖/鍹/騨/哀/翑/萟/皜/嘙/叧/奪/紩/肀/斫/焩/鷮/迂/阕/艔/欐/镳/睽/瘖/遧/敭/汆/沔/幍/墕/浤/窫/薟/雠/隧/岔/峪/栕/昘/蛿/垎/敂/瓈/瑑/卓/魽/彚/薧/睂/儬/杭/瘘/毆/嵦/傒/谂/弍/鸞/舧/簾/栔/鑤/晫/侼/骞/饣/鼱/懴/乤/蔳/輶/巆/璖/鬦/蔜/峍/甕/朖/萂/觨/軓/昪/炃/鸤/竮/窋/蔘/貣/貧/剃/龊/魦/檸/鞤/蝎/黄/柺/氮/獽/賎/繊/寁/瞾/魥/熍/蝉/臻/岿/寝/仉/狁/櫨/蕋/沷/狓/刄/嶕/獔/瀌/泸/妍/鈭/糡/嵤/匡/戜/迒/嗯/麱/蹆/溑/砱/垔/唎/羱/銞/胥/悓/佀/焱/緆/羗/追/鳢/疖/聞/掚/浴/危/蕺/褒/晰/蝝/俶/扇/壩/噯/礚/媟/涄/芣/婛/軙/喪/澴/灒/镧/錷/瀖/鷍/宗/沈/陓/釲/炀/伪/紘/鏾/嚩/惷/铡/飛/鏵/馘/嗗/汸/忌/鼞/鋨/徂/竵/柯/瓟/醚/饤/圚/鏭/冉/兕/鶚/圳/鋳/埰/銕/陂/挂/戋/醹/捀/潂/槒/閡/纜/噲/扪/嗌/鱚/嚮/吒/顬/蠼/婢/砫/狜/岁/鷥/渐/嫥/樻/嚬/鵴/辶/桢/甕/鈗/脮/愁/嚞/莵/捡/珙/蝮/莆/谏/湨/楹/呝/秛/慄/训/洃/秩/闰/牳/凄/悗/餖/颺/錓/祫/愰/狁/壦/犐/畀/醶/騙/鮥/檀/釦/珂/觀/菤/嬦/舉/鏠/閆/段/郩/惧/禒/怶/尟/妧/荥/噁/荆/睵/茋/做/鯿/駎/鲸/夦/嬄/纰/齣/狞/萗/徘/楇/帥/蚃/嬺/陣/薳/殹/擼/噿/閎/繉/葓/荛/儯/闕/谷/饬/彅/觩/弇/呉/罇/垂/劜/鷟/岘/戃/襛/錘/紻/轑/蛎/伃/浽/眽/襰/徎/軛/賃/琷/捗/醏/紐/岈/柇/輍/覝/筭/裣/鄣/螄/汐/艜/顿/瘥/秶/延/幩/恁/覕/読/艛/筈/銙/鲅/覡/馚/儊/奿/惓/幍/稥/澔/檴/薉/郉/謼/垱/沫/嶦/祂/逄/据/蝭/沁/邖/屈/矖/憘/钂/鼋/樵/賳/驑/轶/數/唷/砹/轖/闝/偺/丣/堵/荪/樅/鵿/墤/幦/堆/餰/鉘/懓/亱/祹/锒/襖/偈/畻/瞏/蔑/臘/矫/糢/讘/瓽/冬/欭/懪/尃/榙/孎/没/娊/擵/途/肠/碀/嘤/蚔/鱬/痛/擂/佔/绣/蔱/聄/卖/繱/榼/瘅/奔/銇/瓆/鬺/堫/賏/噺/棢/鲇/蒳/俪/咹/粲/謴/獪/拠/嘷/鋔/旌/挅/猗/矌/樹/倒/昈/鑁/馘/舟/矘/硨/鸲/吘/嫀/涪/邫/滈/鳦/餁/懦/癴/淧/裠/逎/鹘/茦/藽/懼/崾/硊/脮/虸/繻/脒/瓲/醸/螔/忁/皺/誂/民/曻/罥/牴/煀/廳/烥/肬/涻/帷/茺/躄/廨/苕/浿/偦/河/躄/皃/弯/腈/氞/賡/寝/勾/蓥/嫻/籾/嶧/豧/冝/饽/傺/笥/曄/鈁/玉/蠖/眓/瓊/俇/誆/齢/駪/畕/孽/勌/帱/憁/米/便/瑰/抋/苽/両/挏/襵/觹/癵/兡/壧/椮/檾/岡/樊/霠/籕/忾/斕/菚/鼆/殗/玄/睅/筶/膲/户/槂/哈/矂/磦/泼/羇/徸/佯/唒/蕬/啳/罥/掗/政/柗/楑/譍/舒/忭/氋/劷/骵/薷/禂/陓/茮/焺/軚/蜪/穙/俯/皙/肗/隀/碆/诌/欝/鋛/不/樨/砷/釺/歯/宀/撾/潖/噺/棰/覑/摊/儂/蕶/庀/伨/烂/焂/饔/鼇/踼/釛/偏/魞/輪/抿/劄/射/壶/閤/纴/趍/諨/娎/糽/晄/設/魾/珁/蹯/駀/虥/殕/壼/昝/粙/輈/鐑/勽/玐/両/墁/街/坟/磺/鄋/嶷/阗/釒/補/煭/沲/雫/躳/馾/窱/侌/姐/箸/獃/廃/暁/尀/栘/踞/茮/臎/脥/癚/漸/魴/攘/锬/蝏/鹅/檰/鏨/曌/歘/欫/葅/摱/鏇/嚔/敂/玝/訸/鑃/穳/寳/石/鈘/荈/襴/穴/鶭/纹/闵/樫/褒/脠/秏/嬪/鵍/測/賈/憯/鉾/絩/塇/能/扃/屸/筒/乙/昃/娹/堔/祈/在/撃/晙/琗/鄸/詞/鰍/豹/萯/讚/跩/埁/卢/嗪/綹/貯/昢/琹/狢/鍕/閉/螙/藿/呲/磽/踊/晾/鼔/鸜/鮋/懶/唻/劤/琁/訯/囐/淟/鐯/鶲/絫/簍/饂/鹒/罏/穮/觿/斫/佴/驑/啑/呞/轮/鳵/鞊/舄/亾/櫺/等/缓/恿/钥/偾/勱/矚/槭/鄚/瑛/嵫/鳤/鵍/驓/乍/詚/淫/莴/唪/卧/狞/塢/浯/鍌/囩/艓/坡/蒗/蟈/和/盅/祌/臷/八/駇/怲/学/暛/藼/睴/圞/跅/邷/惺/罫/雴/柄/剩/冃/怮/萶/櫚/扫/滶/剘/蒺/釰/奊/爑/魣/齰/鷌/蹡/鯶/凰/嘋/糗/菂/撒/蛈/柴/稀/嬤/肴/婰/鎂/进/攕/顮/鵀/黸/惌/弃/髰/菏/騁/筄/値/赠/琱/傔/硺/尃/篡/叝/焏/眩/史/鳡/駌/漺/梳/鲃/嶁/薘/韦/戎/犁/陶/欀/纳/螬/厍/赸/鼮/嚼/遺/旽/輌/薞/嘽/艟/糇/臼/戩/垣/揫/呟/撬/懾/塀/厙/倧/敷/鐪/輀/姊/桖/吻/蹕/輋/恹/两/鬀/詣/磀/舽/膴/鼤/憙/厐/鱆/譫/隮/膷/耹/禎/槪/亙/拈/釜/烱/窆/簍/僟/琮/憂/澆/璊/詄/鏤/仁/煫/对/寗/藈/吝/螉/獢/翞/崭/篱/搤/鐢/翄/囚/汾/緌/仈/戠/当/号/墠/蕩/箤/嗝/慙/驀/铥/詓/捗/騍/敢/蠚/茅/鹞/堅/蚗/柝/马/蛛/厫/貖/湑/眫/峭/牟/掙/养/鷉/崫/朽/癷/珸/母/钒/檶/述/憻/蔁/癘/墦/绒/拼/蠨/蜗/哸/鯘/暻/霱/磣/澁/苩/穳/嵾/挰/承/恁/閰/柩/錅/咗/出/啴/錇/缗/罝/悑/戋/聓/綖/躝/鋐/覾/簇/伶/暞/枙/矋/綽/陏/粉/谆/軮/摴/庤/聬/滤/篽/镞/黃/寱/袜/猏/谅/戇/螎/沿/鐆/憵/彸/踤/款/癧/磏/氎/慗/貀/濟/襜/夻/唭/岊/旝/纍/飖/弩/斋/颽/妾/赕/晿/吡/渟/輁/篠/炒/煮/嵤/緐/伛/雱/毩/风/軇/鎳/熂/诅/錼/浚/浛/聨/攺/栝/剘/渭/篪/铴/慖/刬/住/柡/廐/檃/鮖/偕/荋/籕/蚍/綔/鞥/艫/阿/鲲/腚/硆/桂/騗/錶/駝/疡/隭/蟸/计/倝/杗/窉/皷/礛/損/侅/防/渱/汞/蕽/拍/篩/鲕/乜/嘡/蛧/睡/拥/勐/歚/摁/犨/譁/涭/斵/褑/悽/鲡/遾/樄/甫/汇/芙/縗/鏀/閚/簲/述/儫/纑/株/廏/蚾/梮/綦/懟/您/畎/桕/埗/掑/潬/顧/髄/戤/璆/憡/衳/烯/瘿/釒/茗/閡/玲/義/雐/謞/菱/霻/檶/駅/奢/瘻/搰/牭/筁/苘/陧/萈/弸/锅/絨/谿/当/佯/鏐/鶩/褷/送/慜/幬/卫/炮/湢/紦/鱬/緂/嬖/拞/矮/煑/耠/暁/雄/焯/欈/鯬/飸/樁/姶/刀/溨/臃/箲/蚅/趵/觪/磾/捿/葋/荧/來/旷/燂/般/癏/潳/鍦/僰/諜/愸/厤/鬢/狃/题/芃/灻/焥/悙/嫿/礶/媗/錀/裵/鴹/囐/灯/礮/洱/柚/怕/嵧/蛰/嫋/柖/澅/蹃/憓/輎/纩/杸/裧/襟/眣/凬/稰/忟/痊/媙/掐/觌/禁/檂/蔭/黎/翎/铮/暛/潭/鹛/廱/齥/鑐/侂/痻/嘉/聎/犚/瓠/暮/簽/謜/埪/衩/郝/嬷/撗/毋/踝/己/囻/謏/嗃/湪/滕/幗/笻/碞/関/犌/瀅/莯/莤/焍/毚/包/皧/烆/迒/纟/眷/鱲/薵/厧/竉/吡/躪/穻/狪/混/姤/肔/莁/雞/燓/忱/圭/嶘/慅/筻/薯/俳/鬳/貽/局/蕍/猣/蒶/豬/匪/鰠/緃/篈/糧/扱/薱/顈/雺/篥/嶝/跆/郄/塈/脮/唨/篭/殪/狠/蔣/聽/槽/穗/幽/灙/圦/胶/溅/患/縅/篋/梋/埇/沯/驿/轇/鲼/掝/罩/鋍/描/竬/桦/烬/軙/邃/訿/剫/猵/陔/佧/败/堭/尧/訞/醱/鱃/沱/呈/棘/褿/鴡/覾/谲/嬍/郌/痦/蕬/怃/姖/鵼/儑/趲/敚/溉/摬/爷/朗/绡/糋/庄/囸/蟆/递/莌/嗫/瀚/萪/盵/絀/禮/娒/学/昳/箉/縇/刞/櫲/輘/鵈/賐/箴/邮/煛/挡/韺/铙/砦/螜/誱/傼/哼/筟/袒/檰/侉/汈/徬/暹/渻/釶/斤/壮/輹/譊/繨/嵍/礦/胇/疋/耗/駤/唩/鰈/矛/蜊/犕/莒/塍/麘/酄/痐/欒/瞉/磉/凤/矞/焻/褸/榪/趑/絺/騄/躷/謙/鹗/鍢/牕/蜴/淘/幣/圹/潆/驘/欈/缍/兠/肰/呉/黃/懣/瀡/閷/蜾/啡/啵/鬤/滬/鵐/榬/娢/謣/胳/稷/妈/瘞/霎/磐/赹/饞/敺/嵝/敽/衢/憡/怴/穌/邜/凡/蝧/惞/褘/犱/鳔/蘥/龝/憭/坍/邤/栂/瞎/蹉/威/抄/玔/芖/续/漖/辘/岼/秋/嫩/狕/縏/绽/閎/忙/暟/蓣/鵛/璑/筍/荅/让/匝/勽/狏/漠/鐨/瑵/够/槣/濛/脤/坔/餋/管/鱅/椊/匁/爟/嘮/棾/遵/苭/匫/对/晛/鋪/兖/齀/黬/鱙/毤/鯼/俗/膅/鳕/崂/蓰/鑐/众/盫/硧/則/尻/涌/樟/赙/鵧/匋/輘/錙/谆/槒/郹/浪/泈/唔/亍/慳/绖/溗/柝/蹴/笮/燑/螯/罠/膐/撻/讙/繃/伜/趉/獐/謋/槅/唌/熔/柎/郿/殸/羈/皳/瞘/熮/翚/硾/芶/觙/潑/眇/廴/湲/鐟/嬡/莬/湜/產/燤/梴/笫/勫/皯/鱱/沣/暬/徱/撜/礻/叠/你/澸/簃/炦/碿/釸/騇/讦/娝/撖/嫸/諞/鈤/鸑/鸥/錅/镧/窬/憫/奥/籅/迮/怕/仱/軁/埾/齰/緇/蘑/抮/譂/繑/岹/杇/膊/枸/埬/梩/桥/鞪/罫/趛/胣/凓/霒/篳/鋝/晅/卍/胂/繼/糑/暭/敂/偈/薅/絛/羷/補/柤/軺/踲/奖/峹/颌/錘/顠/謑/呠/齙/勬/萓/樘/鯾/駢/込/痩/犖/紃/維/樵/鷏/汣/烫/圌/龢/穯/謀/溆/橧/轂/芅/噇/楍/痽/叉/蹼/椁/海/簶/輽/盦/菻/擎/饀/鎗/芷/盯/譼/罵/籛/饒/绾/恺/枥/挗/霩/鵓/鼀/燡/腶/嗋/殦/織/關/鵢/德/醡/脸/瀯/潳/洞/髸/爁/蟦/蓸/鍀/爎/稾/唤/飲/褞/娀/篈/剓/乮/刓/臊/呴/冘/凧/贿/謝/拭/澴/嗴/荛/鹑/覒/竆/蟚/巓/湼/呪/鏱/濹/涯/鐑/羘/僦/囟/翂/劦/屫/帑/合/佧/竏/傸/筩/措/皾/磾/忸/套/鑾/堪/畑/睏/怲/鉿/岬/泣/馟/铌/欔/鬛/庈/與/旸/祷/擢/輊/俢/虠/辈/鶞/粆/鈣/饎/獩/肜/癜/铑/鬥/据/詁/揊/煨/疷/鳍/鱦/鄳/趝/蘧/謍/蕋/肶/鋭/姡/涏/毱/曯/鉦/渫/鏱/浇/浃/候/烹/谸/鰎/籁/佽/掟/犿/蓗/惐/只/痈/囵/詤/顉/観/搘/臇/禈/鉵/轤/嬦/濳/缝/旬/槮/剣/楉/镲/骈/犈/拼/綵/谷/剧/刦/婕/廅/勓/粯/貼/蟶/猷/啗/閺/巡/靭/複/嵻/脜/恪/岴/尦/儘/恳/蹡/膆/银/榔/围/埇/鷄/豼/蝟/跬/暷/娥/樯/鲏/脀/遜/弘/傠/甶/铄/煝/疔/岣/皓/傟/隀/峺/朶/鳝/胺/嗞/輪/塢/晃/粰/砟/沠/擻/珥/慴/徒/胔/斾/愵/铢/葔/錘/郩/娬/漟/媑/襱/喣/牦/亥/宷/舤/穩/鷪/熂/鑤/杕/駍/嗐/枈/堅/贲/狤/揁/崼/蹅/愾/墔/绕/涊/仕/剱/膴/迴/溎/郬/鶩/礡/烛/详/亟/毿/訨/慟/呭/龈/棓/鼡/眨/晶/共/骋/駔/砧/磩/惚/詍/臝/耨/芞/鎱/补/薿/魢/頕/骫/肹/列/澨/晶/腠/禋/葬/蓱/闗/俳/鑞/唌/礩/棖/鏣/间/懓/湾/瀗/熠/庢/丼/蕢/婩/栯/轛/煸/颹/睞/蕽/偱/哂/睃/銂/勧/甉/猼/苢/堬/鵫/蝏/婦/芄/蠙/肷/憃/酮/揺/倸/嗬/眊/鱈/仒/價/偖/贬/楴/厊/厰/焱/哱/鲞/燇/駍/惭/昶/怞/蠀/挊/醭/否/鶄/藞/恬/鸢/坊/免/嗉/涽/櫞/誊/毿/牞/韅/藑/奎/蓽/北/齜/菽/碃/丹/仱/鑄/层/厫/刳/釉/逾/澲/咝/犑/丩/鋷/饎/撳/帳/郫/褱/鉄/禐/逳/傉/繨/靮/俴/蜆/艓/蓞/霼/賟/馄/駆/撊/槜/曩/拊/偢/色/騁/皡/參/功/衻/萡/璯/畺/瀇/鉘/尅/玆/蕘/霣/橁/筱/玥/撱/弸/魧/哬/晹/尴/鄑/覂/菔/段/満/弐/栨/鏐/钳/胩/鬉/砠/眦/构/馢/瑱/疆/篽/微/飪/歳/戚/浒/娠/类/罳/鬅/氧/峒/湵/冴/赁/鯋/巿/型/癮/窛/岬/塛/膛/磪/葿/雑/櫈/癗/齦/硞/牅/趍/奈/汓/沺/轼/揵/袘/愻/箕/艹/礋/鄌/鈗/樽/祱/尢/釁/劺/獒/乪/嬑/阧/慙/爩/劘/鴸/毜/鞃/痉/瓂/窠/憟/喎/癏/貳/闽/縗/軷/釀/餧/郜/曅/哘/鯃/桿/砯/朠/揃/馹/婕/赎/逊/傿/螎/齺/豥/珊/媧/浒/鎻/蛀/萯/閔/鬇/樴/煖/湲/交/旗/匬/岎/龓/謐/麙/銃/毰/澮/細/度/廠/祖/邠/騏/殫/亃/樈/红/嫲/喤/薺/潐/烇/鋣/噬/媋/媇/误/訉/恠/丽/劜/谹/幎/堯/腧/澟/羐/灧/芲/脴/蝕/竎/抐/计/浿/耤/苻/萙/渿/灒/涛/瞞/隞/毗/粹/脊/豆/酄/諚/欆/慧/櫷/歗/褩/醻/魅/鍴/奓/淓/井/儲/梐/軹/铔/裇/委/願/贩/牮/罦/厈/錿/穿/挃/囻/錕/瀺/罽/僆/宓/枭/问/緐/镙/鰖/嘫/傅/瓚/炞/鮜/蝉/箫/毱/棿/许/幵/愂/儑/蹠/昣/毆/汳/賧/鲺/澅/蝀/濇/姢/螚/圉/填/吊/驣/譡/楷/薶/蠜/栌/標/麁/祑/剟/郧/耾/拀/婞/孧/亄/浄/閝/砾/渁/阥/邧/肖/柤/谨/躠/廖/趩/鉳/瀰/鐂/莬/睷/钏/契/旸/陜/孢/響/乧/燮/筡/讹/銜/愅/詠/碢/鍗/丏/茇/鷌/紼/潯/詉/覸/殍/諽/濗/餛/怨/鐬/畏/螶/恀/籹/颅/昉/韞/釅/縎/贸/俓/距/璎/膓/搋/肜/趜/宙/瞶/萉/趹/口/鹙/匍/鬇/螄/桮/貅/罿/婸/垘/揷/灘/眑/牉/幭/呵/瓓/艕/匵/騅/藫/蔶/纜/永/檻/铷/厊/絬/仝/莇/構/莔/豸/摽/盌/鰅/壁/揟/訙/珓/幐/壮/浐/斋/諵/蚨/抚/獨/读/覞/奓/埅/櫗/檳/癘/炔/憋/垦/攽/须/镺/神/稽/嚬/啴/肠/崸/膿/睲/剎/俓/恇/請/罍/衎/瓄/蓈/騇/湃/蟐/颊/裠/釣/脁/郻/啸/駅/評/萠/鏸/慠/嬉/禥/腜/聀/磦/泩/弆/蔶/忦/拝/錜/檕/紵/芽/佷/艬/嫛/銟/茧/劶/菳/公/邻/稦/鬥/對/掓/釒/坒/峯/毣/猛/訍/蜪/憈/兽/庺/穊/稱/隽/璼/犛/屧/灧/怆/鷽/澪/陁/况/岙/缜/瑿/豉/婸/晅/秩/嶃/颮/衟/咽/愀/鲡/恑/辍/崝/槊/籜/腩/逎/镃/鮺/呖/垘/吂/灚/欝/铦/墆/縥/葝/痬/跃/彼/改/申/孫/鵡/閃/駤/撫/仒/组/首/様/蔲/黳/豗/驁/烻/氘/吵/蹭/徎/攲/韊/粶/詹/蘜/橣/枙/鲢/糫/汉/廼/啴/嗚/瓛/噖/允/笣/虉/駘/萱/禳/牣/瀞/逺/挀/戢/鉪/扈/渨/鄳/搯/邐/薍/坪/萺/曼/觵/凱/溯/欧/蘊/嵐/縔/遹/砬/慘/菄/當/葿/牞/躈/唩/礧/徝/澀/歶/趑/狌/暡/镀/豫/錛/堏/拙/硅/芑/瑚/忽/蠋/锋/蟻/潍/綀/躑/撫/淲/券/曖/訚/卯/懎/蠱/讁/漷/疐/橥/迋/辇/獅/鹲/轔/阝/攆/鰡/軖/嫐/糧/逵/騾/鮮/駗/榔/識/暡/鈬/暉/滑/蹹/躴/踬/顈/菴/讇/烍/桙/隗/铺/篿/們/矤/錕/鲧/斥/螾/谆/瘵/敐/震/抪/鷩/庸/雝/駊/錤/醘/饽/謯/勘/洕/隍/討/伹/薜/閖/憃/猨/隓/喻/旽/靮/殶/皆/丏/咆/嚍/孿/賺/滭/馶/钼/駵/诰/鲙/讲/坃/缢/灴/三/塦/妮/攙/绯/栶/瓸/哜/莬/燙/摄/靄/黻/瑅/俹/鼆/囶/迱/霰/玒/伔/秏/伞/卸/逥/棈/礷/駉/剎/铿/赔/匷/濖/奒/訤/触/滽/樳/窅/鵃/络/獊/檏/姣/枿/埳/槴/卑/縌/欙/噔/檟/楍/薩/粿/夅/虺/赊/茸/涫/包/霉/參/恊/顪/燡/犼/瓜/亃/毦/鏒/兙/陰/艆/輶/齾/潑/吚/叄/崁/蓇/梠/訹/濌/蓥/峯/峃/婸/刘/謻/捼/冫/韌/垠/盃/遅/眢/裎/砥/嫡/甇/蹙/舙/谣/糅/丿/諜/嘄/旑/蟻/昦/喲/閞/贇/慫/凖/熫/搨/笩/粧/癱/郒/银/闌/紲/疂/禂/睾/鮕/蔌/皖/碋/葢/示/霫/妓/芦/袶/鮰/刴/棡/丁/鵴/吔/聕/塣/詹/嵬/鴓/脀/乽/鈯/憳/箁/鲊/檚/鎂/虩/鏙/粐/決/癀/栣/汨/擇/墂/六/熺/飆/苟/赔/孍/蛏/蟎/桖/價/沕/罳/伖/绀/梀/懽/罃/园/鑴/鹩/應/爵/邠/蹇/齇/酷/勶/融/籝/忤/鱫/訠/蠿/禂/豆/媦/桄/侣/瘎/洸/莭/淮/蔱/抏/发/蠻/曟/加/幊/蚖/腾/惠/傒/秌/裢/讶/緸/鵼/輩/箝/谘/駾/缄/胏/鉉/贁/因/褱/槙/慊/敨/便/扌/跉/瀠/計/氚/骄/閪/浱/夛/爨/耔/孁/仌/斬/凶/駡/鋇/爪/詸/悗/鑎/癬/鶥/僛/踋/樆/歙/郷/藁/蒲/耉/紵/冖/胍/鐦/倸/直/腚/橴/焄/錻/鏳/偍/獈/蝳/靜/袶/慷/盟/犘/褙/臎/笊/璵/硡/瑲/迎/篅/浛/峓/綳/鯳/酫/歗/犡/鑟/撂/喖/書/瞘/趫/瘨/穷/蟀/欮/凶/婰/欌/獰/纎/苕/墺/刡/戉/硊/榹/逐/視/疫/瑴/摅/蜉/塗/儊/褬/蚏/岪/痄/霫/疯/舅/樱/扱/橦/嵥/貏/港/敷/焫/撿/噄/蒠/邑/镤/旔/犉/醽/鳔/傷/壪/洡/鋧/枀/秼/缱/尬/鹌/狟/矌/饟/嵀/回/控/防/硭/劽/洃/砿/丮/悁/冝/狁/珟/喰/曍/滷/笔/翇/槅/顓/喔/捖/饈/聃/苌/艛/鲘/妯/堸/輰/涼/孁/紝/驔/媺/餫/庢/憋/险/爜/鶥/掬/返/鄩/嚧/翜/彼/忌/啐/矊/撙/熝/愍/寵/嶮/玍/詔/曘/珘/葀/儼/飸/敹/妟/焺/叞/趏/碓/束/牄/穪/餳/籈/樴/驵/绊/袇/腯/斛/挎/繜/憜/謝/稃/秩/饮/牮/簞/万/炇/顃/笔/觛/嬴/雜/籡/列/庋/鹱/嫉/蠪/磰/螹/鴢/謝/崐/噴/嚼/亼/塈/郷/敾/垭/炈/倚/圛/薾/鋤/宑/鮽/卥/擘/睰/篜/駪/啸/枩/蝤/豩/塂/止/卜/犆/汙/缫/摼/欟/纪/氅/矈/騔/椎/蚳/巹/嗤/嚫/二/渻/醊/塋/地/梔/実/岗/湄/塜/拸/箣/諍/韢/錟/讴/瀏/窗/妽/眭/榡/萲/帳/敭/慒/喐/埡/溮/鶭/楯/刟/癚/腸/纝/肾/眎/尪/砷/锈/釁/羚/雸/淜/饹/拨/楉/棭/鯺/橢/胘/蟤/鼕/喇/莉/彠/盯/輏/盓/摎/兝/丩/卥/換/鬾/佸/稴/国/鸇/廫/癖/莑/浓/輩/癝/蹢/鹄/鰭/櫃/涙/瘬/咹/蓱/哩/鳱/諎/鞼/觟/熉/嘓/偍/烓/杄/檙/煲/醜/鏺/镊/砼/漛/馸/锪/窪/崧/押/璸/歙/钄/亄/梖/園/梖/頉/蟂/跹/漞/衱/蜏/蒫/槭/虿/閨/藳/犧/钫/魮/橤/樫/珬/吴/砷/匮/蘇/墇/料/隘/怒/绖/矊/派/緮/觞/俨/椮/綩/翬/扙/皥/乩/或/狉/眝/烷/棧/眂/弦/坲/恥/彉/篔/梏/奇/衪/潧/緙/礊/吟/淴/緂/懕/猣/栳/盌/孮/恇/箊/墍/枕/麳/湴/罵/恭/炶/痉/恖/綣/莤/躋/卆/龓/邿/鮅/瑅/洗/袘/儍/朊/圹/乒/厱/墽/鯃/鲪/蔡/噛/廼/徥/殳/濈/襒/璺/蝫/鳨/鵑/彷/蚰/洦/諶/煃/蜵/載/鎴/胀/猪/欥/晗/咇/鉗/拞/馧/擡/複/沪/愧/頇/醻/徢/筅/艠/娝/榜/惕/孧/獧/荙/鎙/褑/嫽/訯/竉/遤/鮭/苠/酨/攝/箔/蠟/頰/譤/濷/睚/箹/筯/箒/脞/檉/桯/緘/缡/煣/亟/眑/窣/訐/劁/睉/唸/糂/甐/櫟/湾/垐/洠/叼/唾/邉/鹷/鍗/歩/疉/鶼/瑯/盔/鯲/鋃/駕/勷/鹣/退/稆/區/衢/堍/嘨/溭/塊/瓞/虂/扫/務/埔/憭/蔷/戅/瓋/嗽/扣/駒/阂/呪/傝/衣/瘵/歴/厫/王/雵/挺/燼/渾/簶/壡/諁/籥/佛/唦/篺/靣/挖/窚/獥/隵/疞/枇/垶/譪/坧/徫/叐/荘/腲/慦/绒/谄/欎/笒/崀/臇/詵/韌/鲜/鶄/垤/秾/戒/偵/铳/秬/磲/骼/喜/廝/摩/窐/誎/瀑/睛/綾/茡/峎/腁/鵌/艈/俖/蛒/婞/兺/癸/叭/掋/茣/驕/蕖/髑/蘦/戽/旫/鮂/盒/迩/恲/悳/糦/敿/儯/畋/泏/姭/渺/聣/衸/会/咄/逕/苒/垐/餂/詵/设/仿/厘/墾/压/睥/饿/疭/櫥/辖/鬞/匜/傐/哞/監/揳/趩/埑/悡/捜/鸞/獹/嵭/鷾/汕/交/薦/奦/弽/沊/六/熓/实/胯/氏/館/榮/崉/鬰/懥/頤/灰/鑿/佭/瀞/申/嗘/礪/猀/祰/魑/繣/鉖/这/稨/弘/鵮/攮/刴/垺/墫/劀/撖/擪/泡/虲/窧/釱/魘/襟/隖/爮/撬/暺/髻/啯/譎/彧/皵/彉/屧/鞟/茌/艊/岝/頊/絎/漘/嵄/撱/吶/嶾/炅/輪/磜/儧/獪/偡/锣/燤/柵/玂/珛/狤/鐔/櫤/鵙/娏/悫/薠/岛/鹉/圌/寲/偋/乁/鶓/共/懰/纯/脠/怏/广/塲/睔/裙/弜/輇/鋄/淣/伮/呛/瘕/塴/廂/鄶/宷/簑/稌/蝣/黺/獬/鑍/珖/甪/崆/龚/銓/绢/痯/打/溶/洦/趱/篴/踜/肥/廱/溼/驚/罈/暼/劣/鎟/篡/崗/臮/缑/鹝/濖/鹰/聨/聆/鷠/胪/荴/慎/熓/嚺/硃/磦/烏/翷/浟/颁/箬/獬/蹷/捵/閄/猂/朙/凌/鮪/謟/旦/臃/僨/艌/紟/掕/渢/篎/蔼/瓒/辯/拫/醩/奵/刔/塂/陃/袜/粠/煙/踖/涾/辀/諠/憧/袟/硿/縲/鋖/軿/熩/厊/襚/匳/赅/灢/疘/埋/琾/龆/晄/脱/锽/朘/乍/竖/妲/愍/寜/鍎/進/奍/岻/晥/鸴/瓠/晜/営/萼/嵯/归/柅/潽/夼/堎/贳/障/亘/狎/顚/丟/硰/愬/沟/備/覦/讈/杯/睲/稥/勗/抧/瘓/汩/焏/顶/喆/锍/薱/鴀/醌/樶/諰/灪/啞/谭/娢/柕/蝥/儨/拍/珮/篵/嫄/箤/螡/鶓/笥/塢/禴/鈥/轛/奵/锟/縲/崀/蕀/楑/犐/弯/区/扟/朇/崼/奙/膼/龗/頉/珙/卖/凭/棱/鮇/辁/廴/钏/囲/狩/嶋/双/嘁/笖/觳/鈪/掑/醂/狞/皂/颽/濖/兘/筓/垉/榮/詿/鷽/嘴/怰/跁/劀/镗/薞/剮/侅/鬇/兴/摗/脰/憿/釦/嵖/蒻/朦/申/嵦/噳/渧/膡/鑌/徥/需/呸/翿/颫/命/寝/情/赜/伐/鑷/缎/桠/挸/兆/傆/瓱/闁/僛/猋/扠/舦/碴/巕/娸/俠/猣/娏/潪/翩/擅/国/过/裈/疂/檑/儷/夜/奸/簂/黮/翰/蚮/飑/薺/鰍/蠓/輿/滄/仪/俳/烾/鲡/暏/餀/敲/渫/岟/烟/欙/瘞/袢/括/馾/碗/鵳/駠/咗/嫠/凈/龁/煃/吇/燥/秕/豷/亶/犖/饆/蠫/蔏/搳/蒜/稆/唆/敔/伲/迧/埯/莕/郆/孠/沰/咈/駯/埡/螗/亶/垾/鱺/柪/唊/椣/嚛/賛/緗/飮/嫎/鷏/駲/纭/燕/诱/釣/淺/圾/膄/拌/焌/懂/嫽/佩/胾/睗/奄/钐/尓/蠻/赃/莎/坟/肌/犾/鑰/礔/袩/裈/榗/柯/僶/傚/籤/信/蟿/婸/妷/拡/箣/铘/袮/螈/恞/洠/錂/弍/唋/鈛/伪/缷/蹄/屌/关/汃/腢/铯/曷/溋/眾/癤/屪/毻/穚/箃/谣/斀/秔/崺/閼/猐/焴/欷/剿/嗊/骃/詚/癭/檻/搎/勹/秳/钢/銑/艞/祮/衑/雄/鞣/暢/憝/硡/嵷/殓/篹/綎/咖/嫎/玬/焸/慚/衢/牙/遅/邝/飨/跈/仨/澻/扢/雄/颭/鵨/飬/闖/澟/諨/募/癐/課/戩/烜/荁/銯/灡/鶘/蛜/攌/謱/臨/菰/廬/颯/琪/鬘/碏/哕/馦/濠/戗/個/宝/敡/酲/湼/袅/钢/蠧/倛/嘖/礍/洿/癘/锢/喽/廁/纆/帙/尟/鯗/漐/阕/搾/鲶/咪/鏍/氱/溬/榼/洕/腄/崮/焁/嚩/蕁/羈/绁/輽/誡/蜸/輒/皋/溨/臑/榧/絖/嵜/抓/诐/睼/蚋/鷐/眰/虦/褴/駆/柼/糧/邯/漌/妬/逧/琥/餩/諉/頶/鴦/揙/輦/劄/藓/屝/癘/吤/烑/峳/黋/挰/翎/欆/匊/愡/釘/琴/雡/亡/商/淋/棉/彸/獢/堃/灣/暥/萩/薹/酴/処/淍/充/齘/翕/郯/鞲/閕/怺/軐/羓/竁/刲/繪/锩/獎/窚/嶒/趐/鑥/鵍/黀/釈/笏/椥/咹/恚/茠/脇/機/垓/鼺/瓃/哈/缣/蝇/糛/藉/昂/鱕/栌/体/綣/鳩/頊/婤/纍/蛲/耵/畀/霻/鶷/锹/鬖/柩/堞/厊/螑/鱟/饴/惑/皡/猰/嗔/迈/攀/敇/溡/銶/碚/亜/店/倏/膟/鳑/嘳/掐/骀/鋩/咞/荟/鏚/叙/唼/轖/鴥/篘/綺/踛/啎/鈀/耈/迬/雨/漄/爼/簄/湇/聢/欖/铲/律/庻/髠/迂/擡/氵/芷/承/蜻/诱/爚/娢/挟/嘥/鬬/鹢/貢/琉/膑/醶/榓/簇/豔/丝/裭/貧/阗/渢/飔/鷺/杰/馁/鍐/踏/翁/癝/轮/屑/鰟/筼/邴/鹩/塡/獔/吘/烏/紷/墩/玿/桘/蕑/贝/壕/鯒/釤/蒉/逦/曳/鲻/劋/珕/鬡/瀎/鼁/泿/崉/徝/揀/款/暘/椷/趒/橔/鋞/閺/煾/誧/矿/纞/王/礒/絖/淪/鞴/椦/铯/掳/馶/箱/瘄/蚌/狎/鷿/盶/圱/毊/孟/膽/揺/倣/馊/轷/跫/殐/駋/臹/赫/焝/羙/寧/驅/搱/榈/輻/腻/翵/靊/凲/亹/夔/砍/勔/隦/屼/衱/襠/哴/糢/龄/剨/帡/砞/跈/倃/醂/薪/娨/澸/趜/夥/揾/楈/滜/眚/鈺/婏/堜/卉/懋/廅/砂/火/菸/瑽/焈/歺/鏏/邗/袥/殤/絧/狔/巂/寇/蹯/厁/哅/裏/了/栲/熉/滘/潔/浜/瓟/倒/芼/蜛/圥/慻/鉦/茓/鯟/菔/檢/睴/監/褔/馅/妢/荌/飡/犍/啚/蟮/喰/棛/癬/襑/鯛/沎/珖/噳/觃/浦/悂/燝/椴/饐/鎆/弸/詤/裊/刡/挠/荴/蟐/饂/隰/動/頖/奎/翖/鰽/幑/薮/慰/泛/樳/狀/韯/椐/键/恙/竭/谡/姙/閴/瑘/薰/呡/矎/卽/症/阱/躕/臷/鲕/庛/鉾/侓/餗/彷/搱/柎/鐅/瑋/骑/瞶/箔/躞/蘎/髿/鏵/閨/迭/摁/傓/昁/瓶/邹/嗷/儍/澇/眈/梜/扃/墫/蝧/墋/柀/顰/從/奷/墆/蒕/舀/緸/璖/鈝/劮/牦/蓴/濚/渻/寅/蕆/绷/袞/琷/嶤/煷/靱/瞐/渽/邸/拍/堮/篶/佶/婦/夦/妕/邫/盎/缄/蛃/繲/薆/騔/挋/恠/訑/犮/俎/图/甅/硨/颩/诠/兾/髃/櫾/笳/崘/卌/牠/跆/鮟/栔/剎/做/鴡/覉/鈩/剭/蔗/蟉/宣/叁/硲/碈/洗/荄/涩/侚/勲/仸/螑/噬/轚/勯/辵/吃/赇/纈/闠/粀/躥/諗/蛒/斛/澽/醠/弟/嶦/暾/涨/靎/锦/俿/壁/仈/瀂/覜/傽/瘢/嫍/脨/儼/魮/記/緢/陘/犋/份/噢/烘/簤/鈸/蹢/郙/釦/飦/勆/璒/戬/継/铗/耵/險/蠨/穷/玑/惇/佄/霔/蛃/稴/暯/尹/湠/櫝/尣/苪/祀/贾/鉷/珷/錧/编/竳/簱/棚/鳓/顥/醘/韔/誌/橺/璲/鲅/駎/形/妩/螌/潢/缕/厬/綝/笇/荩/涛/墆/琾/諗/臤/逽/敱/亡/员/鲹/堲/獙/蚤/眱/概/堑/浥/袛/耛/闵/霎/蘉/螝/窒/匚/鷗/倒/莐/悁/搬/兢/泃/痺/璳/刊/槿/鳃/箭/韜/揼/汥/褣/竄/掸/苎/嘀/媸/襤/鑈/衐/溫/態/姵/陞/倲/篇/鉠/獙/粦/約/謯/楎/悇/鳵/週/釞/沠/郼/覂/鶲/鸦/軏/臥/靛/慓/刮/熙/阶/趦/怉/鉔/揩/圧/譃/鍡/愜/偅/孬/耸/滮/鲆/愝/瞊/癟/镙/匢/瀶/蟿/姧/蕊/杝/渃/儡/屿/蠫/暉/瑣/壸/嬲/矦/晸/犉/崸/领/挧/糵/吽/枿/蓜/编/鹾/逯/鱜/襜/瘐/笷/佝/脼/嶽/液/丨/硖/葖/鯁/纏/矣/裓/忈/侪/伣/摅/痀/褎/譺/乚/螺/欳/鍀/唅/俳/窲/蹵/鰈/駯/邩/骙/輿/釅/牾/腌/頟/胾/慿/璗/恦/烕/蹒/痌/紞/褐/绹/槉/胻/俶/酳/牢/岨/忢/赒/鏑/艰/矴/窬/帧/孪/鏞/贈/貙/曽/寱/乚/撩/憉/燖/蛮/罄/麼/蹫/瘩/耣/厡/萣/敭/啿/藇/竢/访/屓/烱/斝/趑/弐/霃/扴/尝/碾/黃/糱/撮/伀/飊/燏/臌/鵼/珬/姛/瘀/裙/皤/纾/鱦/昍/郎/倩/镋/駮/缂/鑯/碤/隌/淄/荰/鮜/毇/任/漿/棔/厹/姽/槃/玐/鰷/凸/槦/晼/疆/涚/瑩/仩/怕/敂/樔/袲/戍/箭/砣/鞤/靡/唌/畨/踉/鮪/慃/偽/缳/畀/鸴/妤/閟/噾/誫/螁/縈/绷/庵/行/耞/檋/嗡/捲/陱/颣/钾/暇/舍/翚/佽/喟/籠/雁/呆/霜/怶/櫃/痮/舥/搞/谪/軥/輶/碫/哋/麟/矚/蛴/嬂/硤/綳/窑/鄀/債/痀/鄝/裯/手/且/蓝/澌/钆/伄/捋/硙/帷/脹/鎙/堒/鏣/熇/怯/嫍/迩/粱/鍕/剈/锍/獧/蒠/惏/鬊/悡/膮/牝/輋/媤/帖/殶/灺/挩/倯/婱/輠/鏲/酁/馺/绕/鑚/濲/噌/錼/矗/酸/銍/昣/窜/浌/劢/毂/癋/釈/孜/跷/躼/潧/踘/非/漷/繕/懸/鰺/刦/櫿/谂/饆/礫/濧/犘/偊/惿/褎/孪/尣/柝/缫/衂/唯/垃/躙/苫/柄/掯/駬/鈇/踼/伻/睄/泲/虐/袭/畆/狄/勌/揜/鄠/虨/儌/噽/涂/箲/挧/匆/鰕/斾/劍/潖/筯/侮/僄/侹/楿/澹/襀/鄔/螌/楢/徔/琤/殹/韲/窘/刹/欑/芒/芚/酌/橿/岱/盁/樧/渜/榑/湍/惟/鑶/蜎/橇/珅/俨/釢/勰/閇/莙/麾/湜/蝮/蔈/晲/鋂/签/齃/允/輺/遹/璖/鬩/茹/祖/齡/銦/壽/璟/鎊/淃/燱/癚/炻/攩/昧/澉/钐/邠/倕/繝/鵜/漪/蟡/戥/鮂/枞/瞄/樕/毾/幹/纆/肤/集/韢/蘁/柷/俜/欝/异/疯/槎/摼/鹎/扛/梗/预/鼻/靧/诿/縃/對/懍/裴/閿/襟/扡/珈/鱧/脶/臶/篴/攇/苲/彽/沸/嫓/硲/寻/使/锌/玚/砳/頚/樒/庚/莮/眍/稢/認/焗/鐱/灱/铺/燑/穈/鷬/糃/虙/宏/炪/芆/夲/桰/舀/钘/幾/巯/瞹/床/帒/弬/輋/尵/泮/鮷/畣/歍/櫏/倃/衇/岢/胎/牖/樼/雥/鈼/哬/絟/牀/坿/琥/嶍/繩/蹰/叢/餯/縁/橍/髣/鵛/絃/霫/箛/孢/阩/嫇/囜/倬/竔/凃/豋/琍/枳/沟/乢/靭/参/斊/秕/椔/頝/板/躞/偲/玾/碥/弘/駹/焓/邠/厊/躡/敿/遃/崆/樄/杰/鲨/鎈/畻/腽/渞/罎/沲/穿/鞁/緡/蠵/慪/昉/濮/厌/膾/绦/馥/櫣/苵/滩/膕/蹒/珚/舲/籶/骢/铗/壺/蹱/惫/換/礝/臊/璀/左/皧/靌/翅/縰/簣/欚/鮱/鞖/虈/鲱/猽/蒼/氍/荓/爦/湅/猯/靟/縜/啖/韘/瞰/艹/砿/昕/怚/诊/歿/齌/棽/癐/衐/恓/赦/闹/聾/赢/凪/蟰/億/畚/旮/佨/轗/靬/骟/駐/鵯/蕐/琝/业/潓/誗/訚/鉑/樣/缹/跒/毿/鵭/礊/畄/甸/窄/濫/鳵/訑/蠜/迴/誾/算/痵/爕/柋/弊/燊/韇/鲎/倫/钊/浥/爎/願/棜/剭/魫/萔/橰/帞/傸/誐/錃/鬭/泭/憜/嫢/粱/蟣/謒/匄/湦/霡/傝/蚽/臁/倖/緁/獽/蕚/劚/秗/漒/祁/訋/婦/桘/廡/埮/趮/庎/袥/湙/稻/医/斀/檁/恌/苂/晤/氭/挊/耴/格/仙/瞫/靄/緟/姺/麯/揔/傫/漒/迬/轆/鞜/荈/贰/潦/阵/噩/勦/忳/縑/吆/堖/殞/槨/鏓/噦/豃/虒/襎/鴡/淬/赾/饭/酱/镡/麻/敗/赂/饷/凮/傷/摤/括/煃/鳶/拡/秙/甍/嵧/謶/颸/鋵/綤/觡/毥/疙/秪/賈/軐/槺/氻/冝/嵁/笯/幹/趂/蝥/堓/亝/莹/唌/蓡/蜿/櫏/譯/黧/巭/蘺/窿/角/溙/況/櫔/丣/幖/藊/纕/蝣/姶/駶/讜/儑/鄽/斷/驧/偯/犼/癊/憠/眱/碐/髖/畄/硧/褳/誾/町/瘄/嚡/第/黒/蘓/噰/齾/齮/卺/蓈/狰/嘨/贞/體/貭/蔙/墆/橻/莕/盄/闅/听/楟/貧/坔/詿/臟/圿/棠/沤/堊/稛/磨/瀙/藊/焥/貤/燉/钕/剟/鄺/帾/劀/輏/礷/獔/冘/曣/恺/讬/芵/磋/睐/僠/趣/鸌/儐/劆/己/茥/果/瘞/澮/瑑/鯲/櫾/麔/挵/縳/肧/宷/貯/桠/墌/肤/鴶/鴅/登/粓/棜/釦/鲰/豂/鞙/僂/膌/烧/懑/鈼/琬/駡/袰/郡/嗾/絖/嬘/滏/玶/佚/玠/鸗/葆/蝏/瘭/糠/鞓/漴/滵/忳/懩/秐/刢/鉝/葺/籾/炷/笪/銇/邪/闋/笤/蹌/阗/崲/沥/齰/迻/控/笕/匙/衐/塷/鄮/淣/華/佛/腷/沲/饝/瓺/漴/鸼/飻/浹/籫/銼/钴/攂/藇/璥/缴/镁/獟/濡/逧/梦/輲/殅/詘/濔/嶂/幫/麎/肙/槀/葋/邖/厧/瘭/諰/獞/肕/鎸/揬/玓/鑔/鞬/缰/簑/撳/飍/锞/蚬/堟/妫/婜/錒/峾/殂/鷠/眎/簶/婄/楁/癬/箮/瞐/蝇/紶/恖/會/倬/廋/街/醤/融/頞/鸃/嬠/俩/僆/岼/賚/晒/漩/撘/荬/稲/橾/魼/永/獑/廁/诸/鞏/绳/瞙/煍/描/靁/硹/嚧/存/昸/婙/嵖/粰/鳲/聢/爞/媾/馂/馦/蠜/哕/仉/忡/糙/銒/岭/檺/勭/蒭/忻/鲎/瞴/緳/衒/飲/驡/儆/瓄/礤/蟑/倔/楮/戂/涶/锭/虇/椹/脨/矸/沭/夈/坾/忄/嶏/溘/鈓/鮒/賃/墰/裋/羭/鋭/莲/但/欸/年/声/暠/嫅/獮/鋽/莗/娊/脺/歡/呟/禖/警/禱/艰/茞/硻/蛏/漿/盰/掳/誄/痆/罚/鮂/串/技/岼/圴/鱲/表/灣/厒/陭/儂/洐/蛒/闽/訋/茄/魺/務/璝/珶/枘/爚/憾/瘈/嶤/氅/瞯/夤/諁/鴑/骐/熧/澠/蕜/魧/丧/荫/笗/揤/脙/鹆/骉/舧/迄/岔/秭/豩/擼/螡/悪/婬/凯/劍/得/隩/尲/娞/巪/鶙/堾/檖/髗/絢/朤/燵/侊/袞/钶/刃/庐/噸/蝾/氾/譚/饀/坌/意/吁/灰/祤/鐾/钊/虁/檬/秷/揭/娕/蓶/怩/餣/桥/鞢/綾/呁/淹/愜/虄/瑠/槇/匠/熇/闉/粁/腄/茄/趂/蜐/钩/覴/猉/闥/珔/蘺/謌/襌/膪/娐/騦/軭/琯/頣/柝/衁/郇/胂/抶/梢/順/宅/眕/娗/嘁/墲/牽/峃/脯/舒/悤/澵/谥/憬/受/髬/伌/歰/憊/袻/菕/汏/艚/矼/钶/铢/耟/坥/樔/鰧/崪/传/镬/焵/魜/硄/郲/郫/钹/鐳/睦/道/瀊/指/伜/篭/鹵/練/頂/亷/袾/奵/蠌/溅/蕔/矶/懧/鱖/錳/爦/渲/垀/喰/凝/咫/濯/鵪/葵/倬/搗/范/该/嬤/炞/侭/頢/緀/紾/睸/柔/宋/砓/膖/焬/娻/簓/豐/龘/憛/敛/罏/昌/咵/氛/壩/岖/舟/鹪/歮/夫/垻/怲/鹍/粙/耟/煀/甅/鼚/蕼/笶/荷/姼/褊/烐/縲/矝/局/圅/務/爐/砌/夊/渔/偃/暑/狙/嶽/墯/礡/慊/汬/銤/刦/砭/譨/庙/汯/訣/轤/睳/褴/韅/磈/瞸/刭/濈/鮿/唶/涆/裱/睳/豵/囙/殶/駠/沮/减/鞞/咞/釂/炴/挦/肼/碵/珋/唵/爩/鼂/猇/櫔/腰/赥/贡/娰/矿/翑/裌/伙/脭/艂/蠛/琈/萢/鶩/鵡/缨/甭/石/遭/谫/汓/鷠/燶/酂/丽/换/恎/几/攰/洽/銯/阉/澠/営/镹/暯/玄/孌/鑅/碑/覦/蛃/帎/腹/煃/謾/抑/跩/鸿/陖/睕/楷/睐/少/吏/悁/濻/梒/朅/綤/餤/蒼/阊/蘏/笯/艌/說/礧/阡/硘/聘/痡/髧/鉾/琳/莙/翆/齔/浢/濠/驼/胱/痋/诬/莮/鲮/傤/盲/鸞/忘/耒/郰/梩/狅/圚/鈶/王/厢/倇/恬/胰/菋/芸/傞/踋/儣/鎰/葹/糡/磼/洯/黂/躃/鼔/逬/赚/犛/赞/豧/湐/誵/袴/糁/鋶/睢/濝/佴/橬/箁/韇/覨/些/屸/豃/曙/痯/撴/輤/界/泚/姏/壏/誯/鎑/悎/潛/酆/饋/踌/祖/缍/樛/必/歶/馏/趻/敁/蝕/掑/陁/啤/欘/胋/悯/粠/摥/脡/錮/晕/坫/咟/腢/齏/娳/峒/邭/远/啼/徇/住/趞/搂/鸧/莑/曞/軟/濐/溪/鍯/嵃/碶/樛/棎/峬/訊/菘/硩/仵/槏/冊/汮/鍋/溘/砳/韫/勋/椘/蒂/碼/锾/趠/荊/钐/櫂/漝/濞/鰒/囘/舳/艽/胴/柂/轳/疞/羥/浽/嘌/巷/搻/癶/揉/漉/噷/霵/扗/窮/斩/釱/省/婪/歠/敯/龂/匼/襍/藏/嘹/踹/暋/槯/祻/弶/眩/组/魧/媮/蹂/妧/劏/鴢/车/岴/奟/屆/狖/狳/焏/澂/众/蕈/勬/儨/鴱/俘/熈/鶝/肚/摯/蜌/歓/蚄/蠶/曫/茉/鯧/櫮/塴/鸈/小/皃/灻/斱/薛/壳/筕/麃/鼷/朻/漀/拁/篞/夕/鎉/谵/栬/沠/饎/欌/陛/貃/饱/怴/餣/楶/擎/垪/窬/攂/藗/眜/懑/呅/鎓/嚚/斉/氏/舦/旕/髭/洄/霐/熱/玑/鈭/胪/煑/挸/搧/滍/侉/灢/鮮/羫/澗/艤/阵/傜/络/陫/嵢/匲/煌/谀/雕/冡/趫/椀/塤/繯/粓/胶/烪/槲/访/勍/蝮/鎫/硴/匭/剀/偏/綟/蔭/躞/薢/蟑/轴/驁/蒊/妤/牉/瀩/攧/瞕/脞/杀/笞/錂/箖/趍/杝/遱/茈/椚/鷸/鰭/噂/玢/遵/耆/籖/椶/騅/艬/痮/國/妘/纺/膙/沎/楷/绤/範/緄/攻/缃/欀/輼/巿/诿/貋/惲/昄/褳/樸/浝/訮/嫔/峠/嫍/酾/疈/奆/啩/螆/礫/慆/堷/杞/触/鶝/蘾/秿/譞/椕/聂/廁/鞵/羌/翬/睅/忾/焭/擛/瓙/盽/慓/瞵/嶕/溒/騢/鮏/帒/唪/耀/耧/謲/霚/鍶/焷/顒/懻/枡/肝/薋/袹/灌/连/忍/搴/换/婫/銴/翯/葌/嬱/礻/硦/糍/錠/旟/僻/圞/考/竨/肓/扅/埦/楪/懱/凧/貟/虼/罗/虿/說/灠/揸/熏/眺/剱/蔯/勌/胼/觹/滍/紈/鯪/磙/庀/膕/逿/读/儤/擪/钋/鄜/搱/瘻/鐧/淠/籴/觚/屩/仚/祯/僾/筬/筇/娟/茍/兀/蜺/矬/捹/丒/溿/闌/腡/宥/舾/瓽/鼷/卞/讒/掚/毷/葒/柇/冁/巄/毫/屽/蛾/黸/汕/糒/澰/劐/闑/漲/鈖/臲/试/雿/拵/媴/坘/緬/賦/呱/裆/朎/莼/絯/釓/閿/鈿/県/嫫/炉/鋺/踨/鍦/紶/蹻/蝎/嫭/驃/鍁/緕/軈/将/葧/蹋/凰/落/冂/蒈/捨/笌/嫹/讁/譨/欲/潞/勦/锶/叉/垆/唛/盳/坡/吚/幭/侵/輎/澄/蟟/礡/茘/鲧/挷/槞/茲/譎/椕/熆/鶙/酄/褂/瞴/篕/讨/諼/湚/縀/腬/丱/怾/畋/縈/潲/称/甑/竮/蒏/鼂/琭/猏/鑹/迮/谚/崪/諲/绶/坈/砸/螪/鄖/賮/繤/舉/饭/賐/疆/塳/惣/漒/兺/贅/郷/汷/休/夵/十/队/鬧/帀/鸈/兪/溚/惠/鎅/儵/帷/垥/骪/栃/褏/埧/峐/铈/漼/脣/锤/刺/戶/秮/馴/淮/俛/兵/井/瓛/湤/磎/砓/浼/勅/馂/虆/軷/彯/巍/牑/垇/员/断/膬/鈤/楟/瞭/佨/曔/貀/泃/靘/牑/捱/琶/缱/翕/万/啔/聗/紕/丠/稝/罥/膛/俵/衙/离/慴/馓/幘/惤/給/崣/愔/湉/头/料/托/蕉/绡/敱/鵂/棿/娎/鼐/尻/滐/榝/笟/莲/偷/肞/怳/瘯/鍳/结/硱/偕/歛/鑙/痲/独/卓/尸/嘧/爹/饾/鄝/嗁/昕/刼/膧/楊/蟷/癴/箆/锃/率/觡/隚/远/爛/娃/鱗/右/訏/峁/榟/渤/貳/鄌/蠚/迯/疊/躸/薈/綘/骮/势/髊/虔/蒜/褆/啎/退/蓇/踛/凮/跥/旤/眇/昕/腢/孛/絠/鏹/卙/妆/掕/烗/驭/壅/潜/蚻/嬅/迫/錮/廊/禊/钸/旑/哰/恘/枇/鶓/焧/瑎/婽/砊/燝/崺/璫/矻/惓/樣/啳/峸/楥/嵇/謙/鈏/棣/灀/罽/酬/砦/眯/粢/證/挘/岷/慺/嫔/級/朽劔蚁灋嵿齩鶴琓麃沼瀙缹/a/a0/a1/aטּﬂ/2/a3/a4/a5/a6/a7/a8/a9/a_/aa/ab/ac/ad/b/c/d/e/f/g/h/i/j/kטּﬂ/l/m/n/o/p/q/r/s/t/u/v/w/x/y/z/Andro/////////////////朽劔蚁灋嵿齩鶴琓麃沼瀙⁫­‪󠇯󠇓󠆳󠆮缹//////////⁫­‪󠇯󠇓󠆳󠆮//////////////id\nManifest.xml/s/a/a0/a1/a2/a3/a4/a5/a6/a7/a8/a9/a_/aa/ab/ac/ad/b/c/d/e/f/g/h/i/j/k/l/m/n/o/p/q/r/s/t/u/v/w/x/y/z/AndroidManifest.xml/\\/s/a/a0/a1/aטּﬂ2/a3/a4/a5טּ//a6/a7/a8/a9/a_/aa/ab/ac/ad/b/c/d/e/f/g/h/i/j/k/l/m/n/o/p/q/r/s/t/u/v/w/x/y/z/AndroiטּﬂdManif//////⁫­‪󠇯󠇓󠆳󠆮//////////////⁫­‪󠇯󠇓󠆳󠆮//////////////⁫­‪󠇯󠇓󠆳󠆮///////est.xml/s/a/a0/a1/a2/a3/a4/a5/a6/a7/a8/a9/a_/aa/ab/ac/ad/b/c/d/e/f/g/h/i/j/k/l/m/n/o/p/q/r/s/t/u/v/w/x/y/z/AndroidMaטּnifest.xml/s/a/aטּﬂ/0/a1/a2/a3/a4/a5טּﬂ//a6/a7/a8/a9/a_/aa/ab/ac/ad/b/c/d/e/f/g/h/i/j/k/l/m/n/o/p/q/r/s/t/u/v/w/x/y/z/Androטּﬂ/idMטּﬂ/anif\nest.xml/s/a/a0/a1/a2///////////////⁫­‪󠇯󠇓󠆳󠆮///////////////////////////a3/a4/a5/a6/a7/a8/a9/a_/a⁫­‪󠇯󠇓󠆳󠆮a/ab/ac/aטּ/d/b/c/d/e/f/g/h/i/j/k/l/m/n/o/p/q/r/s/t/u/v/w/x/y/z/AndroidManifest.xml/s/a/a0/a1/a2טּﬂ//a3/a4/a5/a6/a7/a8/a9/a_/aa/ab/ac/ad/b/c/d/e/f/g/h/i/j/k/l/m/n/o/p/q/r/s/t/u/v/w/x/y/z/Androiטּ/dMטּﬂ/anifest.xml/s/a/a0/a1/a2/a3/a4/a5/a6/a7/a8/a9/a_/a/a/ab/ac/ad/b/c/d/e/f/g/h/i/j/k/l/m/n/o/p/q/r/s/t/u/v/w/x/y/z/AndroidManifest.xml/s/a/a0/a1/a2/a3/a4/a5/a6/a7/a8/a9/a_/aa/ab/ac/ad/b/c/d/e/f/g/h/i/j/k/l/m/n/o/p/q/r/s/t/u/v/w/x/y/z/Andטּﬂ/roidManifest.xml/s/a/a0/a1/a2/a3/a/4/a5/a6/a7/a8/a9/a_/aa/ab/ac/ad/b/c/d/e/f/g/h/i/j/k/l/m/n/o/p/q/r/s/t/u/v/wטּﬂ/x/y/z/AndroidManifest.xml/s/a/a/0/a1/a2/a3/a4/a/5/a6/a7/a8/a9/a_/aa/ab/ac/ad/b/c/d/e/f/g/h/i/j/k/l/m/n/o/p/q/r/s/t/u/v/w/x/y/z/AndroidManifest.xml/s/a/a0/a1/a2/a3/a4/a5/a6/a7/a8/a9/a_/a/a/ab/ac/ad/b/c/d/e/f/g/h/i/j/k/l/m/n/o/p/q/r/s/t/u/v/w/x/y/z/AndroidManifest.xml/s/000\n0O00טּ00⁫­‪󠇯󠇓󠆳󠆮00o/000טּﬂ/O00טּﬂ000Oo/000/Oטּﬂ/000טּﬂ/00/o0/000טּﬂ/O00000o/000/O00000oO/000טּﬂ/😈😄🇸🇬⁫­‪󠇯󠇓󠆳󠆮🥵😈⁫­‪󠇯󠇓󠆳󠆮😄🇸🇬🥵/O00טּﬂ/000oo/000O000טּﬂ/0O0o/000Oטּﬂ/0000OOo/000O00טּﬂ/0טּ0Oo0/000\nOטּﬂ/0טּﬂ/000Oo/000O0טּﬂ/000OoO/00O0טּ00טּ0Ooo/00O00טּﬂ0טּﬂ/0o00/00Oטּﬂ/0טּﬂ/000o0/00O00טּﬂ/00o0O/00O/⁫­‪󠇯󠇓󠆳󠆮/00טּﬂ/00o0o/00Oטּﬂ/0000o/00O00טּﬂ/00oO0/00O0000טּﬂ/oO/00O00טּﬂ/00oOO/000O0טּﬂ/000oOo/00O0000oo0/00O0000oo/00O0000ooטּﬂO/00O00טּﬂ/0טּﬂ0ooo/00O00s\u007f}>Cxqt\u007fgCqvu⁫­‪󠇯󠇓󠆳󠆮diq~tb\u007fyt>q``>QsdyfydiDxbuqt(˃ᯅ˂) (ꪊꪻ⊂)😈😄🇸🇬🥵🙇‍♀️😅🙇‍♀️😅🙇‍♀️😅🙇‍♀️😅🙇‍♀️😅🙇‍♀️😅🙇‍♀️😅/\\/0טּﬂ/0O000טּﬂ/O0OO/00O00טּ0O0Oo/000O0טּﬂ/0oOoטּﬂ/Oo/00O0טּ00O0o0/00O0/0/0O0o/a/טּ/a0/טּ/a1/טּ/a2/טּ/a3/טּ/a4/טּ/a5/טּ/a6/טּ/a7/טּ/a8/טּ/a9/טּ/a_/טּ/aa/טּ/ab/טּ/ac/טּ/ad/טּ/b/טּ/c/טּ/d/טּ/e/טּ/f/טּ/g/טּ/h/טּ/i/טּ/j/טּ/k/טּ/l/טּ/m/טּ/n/טּ/o/טּ/p/טּ/q/טּ/r/טּ/s/טּ/t/טּ/u/טּ/v/טּ/w/טּ/x/טּ/y/טּ/z/00O0⁫­‪󠇯󠇓󠆳󠆮00O0oO/00⁫­‪󠇯󠇓󠆳󠆮O0/⁫­‪󠇯󠇓󠆳󠆮/00O0oo/00O⁫­‪󠇯󠇓󠆳󠆮00טּ/ﬂ/0/O/O/0/0/0/0/O/0/טּ/ﬂ/0טּ/ﬂ/0/O/O/0/o/0/0/O/0/0/0/O/O/0/0/O/0/0/0טּ/ﬂ/O/O/O⁫­‪󠇯󠇓󠆳󠆮/o/0/0/O/0⁫­‪󠇯󠇓󠆳󠆮/0/0/O/O/o/0/0/0/0/טּﬂ/O/0/טּ/ﬂ0/0/O/O/o/0/0/O/0/0/0/טּ/ﬂ/O/O/o/O/0/0/O/0/0/טּ/ﬂ/0/O/O/o/o/0/0/O/טּﬂ/0/0/0/טּ/ﬂ/O/o/0/0/0/0/O/0/0/\\/0/O/o/0/0/0/O/טּ/0/0/0\nOטּﬂo/0/O/0/0/O/טּ/ﬂ/0/0/0/O/o/0/o/0/0/O/0/0/0/O/o/O/0/0/0/O/0/טּ0/O/0/O/o/nטּﬂmטּﬂmp");
            Path cacheApkPath;
            try (ZipFile sourceFile = new ZipFile(appInfo.sourceDir)) {
                cacheApkPath = originPath.resolve(sourceFile.getEntry(ORIGINAL_APK_ASSET_PATH).getCrc() + "大概算法定节假日子的事业上面试验室友谊路由器械入口感情戏份子宫癌变成功人大学毕业证士官网络连接上面前会计算器的是一样的八年龄均为了解他人们看了卜先生产生炎症候补.flac");
            }

            appInfo.sourceDir = cacheApkPath.toString();
            appInfo.publicSourceDir = cacheApkPath.toString();
            if (config.has("appComponentFactory")) {
                appInfo.appComponentFactory = config.optString("appComponentFactory");
            }

            if (!Files.exists(cacheApkPath)) {
                Log.i(TAG, "Extract original apk");
                FileUtils.deleteFolderIfExists(originPath);
                Files.createDirectories(originPath);
                try (InputStream is = baseClassLoader.getResourceAsStream(ORIGINAL_APK_ASSET_PATH)) {
                    Files.copy(is, cacheApkPath);
                }
            }
            cacheApkPath.toFile().setWritable(false);

            var mPackages = (Map<?, ?>) XposedHelpers.getObjectField(activityThread, "mPackages");
            mPackages.remove(appInfo.packageName);
            appLoadedApk = activityThread.getPackageInfoNoCheck(appInfo, compatInfo);
            XposedHelpers.setObjectField(mBoundApplication, "info", appLoadedApk);

            var activityClientRecordClass = XposedHelpers.findClass("android.app.ActivityThread$ActivityClientRecord", ActivityThread.class.getClassLoader());
            var fixActivityClientRecord = (BiConsumer<Object, Object>) (k, v) -> {
                if (activityClientRecordClass.isInstance(v)) {
                    var pkgInfo = XposedHelpers.getObjectField(v, "packageInfo");
                    if (pkgInfo == stubLoadedApk) {
                        Log.d(TAG, "fix loadedapk from ActivityClientRecord");
                        XposedHelpers.setObjectField(v, "packageInfo", appLoadedApk);
                    }
                }
            };
            var mActivities = (Map<?, ?>) XposedHelpers.getObjectField(activityThread, "mActivities");
            mActivities.forEach(fixActivityClientRecord);
            try {
                if (Build.VERSION.SDK_INT >= Build.VERSION_CODES.S) {
                    var mLaunchingActivities = (Map<?, ?>) XposedHelpers.getObjectField(activityThread, "mLaunchingActivities");
                    mLaunchingActivities.forEach(fixActivityClientRecord);
                }
            } catch (Throwable ignored) {
            }
            Log.i(TAG, "hooked app initialized: " + appLoadedApk);

            var context = (Context) XposedHelpers.callStaticMethod(Class.forName("android.app.ContextImpl"), "createAppContext", activityThread, stubLoadedApk);
            if (config.has("appComponentFactory")) {
                try {
                    context.getClassLoader().loadClass(appInfo.appComponentFactory);
                } catch (ClassNotFoundException e) { // This will happen on some strange shells like 360
                    Log.w(TAG, "Original AppComponentFactory not found: " + appInfo.appComponentFactory);
                    appInfo.appComponentFactory = null;
                }
            }
            return context;
        } catch (Throwable e) {
            Log.e(TAG, "createLoadedApk", e);
            return null;
        }
    }

    public static void disableProfile(Context context) {
        final ArrayList<String> codePaths = new ArrayList<>();
        var appInfo = context.getApplicationInfo();
        var pkgName = context.getPackageName();
        if (appInfo == null) return;
        if ((appInfo.flags & ApplicationInfo.FLAG_HAS_CODE) != 0) {
            codePaths.add(appInfo.sourceDir);
        }
        if (appInfo.splitSourceDirs != null) {
            Collections.addAll(codePaths, appInfo.splitSourceDirs);
        }

        if (codePaths.isEmpty()) {
            // If there are no code paths there's no need to setup a profile file and register with
            // the runtime,
            return;
        }

        var profileDir = HiddenApiBridge.Environment_getDataProfilesDePackageDirectory(appInfo.uid / PER_USER_RANGE, pkgName);

        var attrs = PosixFilePermissions.asFileAttribute(PosixFilePermissions.fromString("r--------"));

        for (int i = codePaths.size() - 1; i >= 0; i--) {
            String splitName = i == 0 ? null : appInfo.splitNames[i - 1];
            File curProfileFile = new File(profileDir, splitName == null ? "primary.prof" : splitName + ".split.prof").getAbsoluteFile();
            Log.d(TAG, "Processing " + curProfileFile.getAbsolutePath());
            try {
                if (!curProfileFile.exists()) {
                    Files.createFile(curProfileFile.toPath(), attrs);
                    continue;
                }
                if (!curProfileFile.canWrite() && Files.size(curProfileFile.toPath()) == 0) {
                    Log.d(TAG, "Skip profile " + curProfileFile.getAbsolutePath());
                    continue;
                }
                if (curProfileFile.exists() && !curProfileFile.delete()) {
                    try (var writer = new FileOutputStream(curProfileFile)) {
                        Log.d(TAG, "Failed to delete, try to clear content " + curProfileFile.getAbsolutePath());
                    } catch (Throwable e) {
                        Log.e(TAG, "Failed to delete and clear profile file " + curProfileFile.getAbsolutePath(), e);
                    }
                    Os.chmod(curProfileFile.getAbsolutePath(), 00400);
                }
            } catch (Throwable e) {
                Log.e(TAG, "Failed to disable profile file " + curProfileFile.getAbsolutePath(), e);
            }
        }
    }

    private static void switchAllClassLoader() {
        var fields = LoadedApk.class.getDeclaredFields();
        for (Field field : fields) {
            if (field.getType() == ClassLoader.class) {
                var obj = XposedHelpers.getObjectField(appLoadedApk, field.getName());
                XposedHelpers.setObjectField(stubLoadedApk, field.getName(), obj);
            }
        }
    }
}
